notebook/blog-2007-11-08-0435.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>eon alpha release. ALSO: the emacs demoscene?</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:55 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content="eon alpha release. ALSO: the emacs demoscene?"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">eon alpha release. ALSO: the emacs demoscene?</h1>

<p>This is the beginning of a DAILY blog series that will probably last
about a week. I'll be building a new <a href="http://dto.freeshell.org/notebook/KarmaPod.html">Pod</a> along with three satellite
nodes, all running Debian. Along the way, I'll document and photograph
every single step of its construction in what will become known as the
"POD HOWTO". I'll have photos up within the next 48 hours&hellip;
</p>
<p>
Also: is anyone interested in running an emacs 4k demoscene competition?
</p>
<p>
The rules:
</p>
<ul>
<li>Your entry must consist of a single foo.tar.gz file less than or
    equal to 4096 bytes in length.
</li>
<li>The gz file should uncompress into a directory ./foo with
    your files in it.
</li>
<li>The files may be anything whatsoever (audio, images, emacs lisp files).
</li>
<li>Your program must compile without errors or warnings, and must run
    in a recent GNU Emacs 23.x (i.e. emacs-from-CVS). 
</li>
<li>Your program can (require) only those libraries that come with
    GNU Emacs 23.x
</li>
<li>You must include a README file with your name and email address,
    and any relevant copyright/license information (this is important
    because we want to archive the entries and winners, etc, sort of
    like the international interactive fiction contest.)
</li>
<li>You must include a file "foo-demo.el" that starts your demo when loaded.
</li>
</ul>


<p>
There is already one entry from Ryan Yeske:
</p>
<p>
<a href="http://rcy.ath.cx/~rcy/elisp/hacks/rain.el">http://rcy.ath.cx/~rcy/elisp/hacks/rain.el</a>
</p>


</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:55 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
